Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB204.h
#define SPI3CON2 SPI3CON2
extern volatile unsigned int  SPI3CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON2BITS {
  union {
    struct {
      unsigned FRMCNT:3;
      unsigned FRMSYPW:1;
      unsigned MSSEN:1;
      unsigned FRMPOL:1;
      unsigned FRMSYNC:1;
      unsigned FRMEN:1;
      unsigned AUDMOD:2;
      unsigned URDTEN:1;
      unsigned AUDMONO:1;
      unsigned IGNTUR:1;
      unsigned IGNROV:1;
      unsigned SPISGNEXT:1;
      unsigned AUDEN:1;
    };
    struct {
      unsigned FRMCNT0:1;
      unsigned FRMCNT1:1;
      unsigned FRMCNT2:1;
      unsigned :5;
      unsigned AUDMOD0:1;
      unsigned AUDMOD1:1;
    };
  };
} SPI3CON2BITS;
extern volatile SPI3CON2BITS SPI3CON2bits __attribute__((__sfr__));

#define SPI3CON2L SPI3CON2L
extern volatile unsigned int  SPI3CON2L __attribute__((__sfr__));
typedef struct tagSPI3CON2LBITS {
  unsigned WLENGTH:5;
} SPI3CON2LBITS;
extern volatile SPI3CON2LBITS SPI3CON2Lbits __attribute__((__sfr__));

#define SPI3CON3 SPI3CON3
extern volatile unsigned int  SPI3CON3 __attribute__((__sfr__));
typedef struct tagSPI3CON3BITS {
  unsigned WLENGTH:5;
} SPI3CON3BITS;
extern volatile SPI3CON3BITS SPI3CON3bits __attribute__((__sfr__));

#define SPI3CON2H SPI3CON2H
extern volatile unsigned int  SPI3CON2H __attribute__((__sfr__));
#define SPI3CON4 SPI3CON4
extern volatile unsigned int  SPI3CON4 __attribute__((__sfr__));
#define SPI3STATL SPI3STATL
extern volatile unsigned int  SPI3STATL __attribute__((__sfr__));
typedef struct tagSPI3STATLBITS {
  unsigned SPIRBF:1;
  unsigned SPITBF:1;
  unsigned :1;
  unsigned SPITBE:1;
  unsigned :1;
  unsigned SPIRBE:1;
  unsigned SPIROV:1;
  unsigned SRMT:1;
  unsigned SPITUR:1;
  unsigned :2;
  unsigned SPIBUSY:1;
  unsigned FRMERR:1;
} SPI3STATLBITS;
extern volatile SPI3STATLBITS SPI3STATLbits __attribute__((__sfr__));

#define SPI3STATH SPI3STATH
extern volatile unsigned int  SPI3STATH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3STATHBITS {
  union {
    struct {
      unsigned TXELM:6;
      unsigned :2;
      unsigned RXELM:6;
    };
    struct {
      unsigned TXELM0:1;
      unsigned TXELM1:1;
      unsigned TXELM2:1;
      unsigned TXELM3:1;
      unsigned TXELM4:1;
      unsigned TXELM5:1;
      unsigned :2;
      unsigned RXELM0:1;
      unsigned RXELM1:1;
      unsigned RXELM2:1;
      unsigned RXELM3:1;
      unsigned RXELM4:1;
      unsigned RXELM5:1;
    };
  };
} SPI3STATHBITS;
extern volatile SPI3STATHBITS SPI3STATHbits __attribute__((__sfr__));

#define SPI3BUFL SPI3BUFL
extern volatile unsigned int  SPI3BUFL __attribute__((__sfr__));
__extension__ typedef struct tagSPI3BUFLBITS {
  union {
    struct {
      unsigned SPI3BUFL:16;
    };
    struct {
      unsigned DATA:16;
    };
  };
} SPI3BUFLBITS;
extern volatile SPI3BUFLBITS SPI3BUFLbits __attribute__((__sfr__));

#define SPI3BUFH SPI3BUFH
extern volatile unsigned int  SPI3BUFH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3BUFHBITS {
  union {
    struct {
      unsigned SPI3BUFH:16;
    };
    struct {
      unsigned DATA:16;
    };
  };
} SPI3BUFHBITS;
extern volatile SPI3BUFHBITS SPI3BUFHbits __attribute__((__sfr__));

#define SPI3BRGL SPI3BRGL
extern volatile unsigned int  SPI3BRGL __attribute__((__sfr__));
__extension__ typedef struct tagSPI3BRGLBITS {
  union {
    struct {
      unsigned SPI3BRGL:13;
    };
    struct {
      unsigned BRG:13;
    };
  };
} SPI3BRGLBITS;
extern volatile SPI3BRGLBITS SPI3BRGLbits __attribute__((__sfr__));

#define SPI3BRGH SPI3BRGH
extern volatile unsigned int  SPI3BRGH __attribute__((__sfr__));
#define SPI3IMSK1 SPI3IMSK1
extern volatile unsigned int  SPI3IMSK1 __attribute__((__sfr__));
typedef struct tagSPI3IMSK1BITS {
  unsigned SPIRBFEN:1;
  unsigned SPITBFEN:1;
  unsigned :1;
  unsigned SPITBEN:1;
  unsigned :1;
  unsigned SPIRBEN:1;
  unsigned SPIROVEN:1;
  unsigned SRMTEN:1;
  unsigned SPITUREN:1;
  unsigned :2;
  unsigned BUSYEN:1;
  unsigned FRMERREN:1;
} SPI3IMSK1BITS;
extern volatile SPI3IMSK1BITS SPI3IMSK1bits __attribute__((__sfr__));

#define SPI3IMSKL SPI3IMSKL
extern volatile unsigned int  SPI3IMSKL __attribute__((__sfr__));
typedef struct tagSPI3IMSKLBITS {
  unsigned SPIRBFEN:1;
  unsigned SPITBFEN:1;
  unsigned :1;
  unsigned SPITBEN:1;
  unsigned :1;
  unsigned SPIRBEN:1;
  unsigned SPIROVEN:1;
  unsigned SRMTEN:1;
  unsigned SPITUREN:1;
  unsigned :2;
  unsigned BUSYEN:1;
  unsigned FRMERREN:1;
} SPI3IMSKLBITS;
extern volatile SPI3IMSKLBITS SPI3IMSKLbits __attribute__((__sfr__));

#define SPI3IMSK2 SPI3IMSK2
extern volatile unsigned int  SPI3IMSK2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI3IMSK2BITS {
  union {
    struct {
      unsigned TXMSK:6;
      unsigned :1;
      unsigned TXWIEN:1;
      unsigned RXMSK:6;
      unsigned :1;
      unsigned RXWIEN:1;
    };
    struct {
      unsigned TXMSK0:1;
      unsigned TXMSK1:1;
      unsigned TXMSK2:1;
      unsigned TXMSK3:1;
      unsigned TXMSK4:1;
      unsigned TXMSK5:1;
      unsigned :2;
      unsigned RXMSK0:1;
      unsigned RXMSK1:1;
      unsigned RXMSK2:1;
      unsigned RXMSK3:1;
      unsigned RXMSK4:1;
      unsigned RXMSK5:1;
    };
  };
} SPI3IMSK2BITS;
extern volatile SPI3IMSK2BITS SPI3IMSK2bits __attribute__((__sfr__));

#define SPI3IMSKH SPI3IMSKH
extern volatile unsigned int  SPI3IMSKH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3IMSKHBITS {
  union {
    struct {
      unsigned TXMSK:6;
      unsigned :1;
      unsigned TXWIEN:1;
      unsigned RXMSK:6;
      unsigned :1;
      unsigned RXWIEN:1;
    };
    struct {
      unsigned TXMSK0:1;
      unsigned TXMSK1:1;
      unsigned TXMSK2:1;
      unsigned TXMSK3:1;
      unsigned TXMSK4:1;
      unsigned TXMSK5:1;
      unsigned :2;
      unsigned RXMSK0:1;
      unsigned RXMSK1:1;
      unsigned RXMSK2:1;
      unsigned RXMSK3:1;
      unsigned RXMSK4:1;
      unsigned RXMSK5:1;
    };
  };
} SPI3IMSKHBITS;
extern volatile SPI3IMSKHBITS SPI3IMSKHbits __attribute__((__sfr__));

#define SPI3URDTL SPI3URDTL
extern volatile unsigned int  SPI3URDTL __attribute__((__sfr__));
__extension__ typedef struct tagSPI3URDTLBITS {
  union {
    struct {
      unsigned SPI3URDTL:16;
    };
    struct {
      unsigned URDATA:16;
    };
  };
} SPI3URDTLBITS;
extern volatile SPI3URDTLBITS SPI3URDTLbits __attribute__((__sfr__));

#define SPI3URDTH SPI3URDTH
extern volatile unsigned int  SPI3URDTH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3URDTHBITS {
  union {
    struct {
      unsigned SPI3URDTH:16;
    };
    struct {
      unsigned URDATA:16;
    };
  };
} SPI3URDTHBITS;
extern volatile SPI3URDTHBITS SPI3URDTHbits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile unsigned int  RPINR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR0BITS {
  union {
    struct {
      unsigned OCTRIG1R:6;
      unsigned :2;
      unsigned INT1R:6;
    };
    struct {
      unsigned OCTRIG1R0:1;
      unsigned OCTRIG1R1:1;
      unsigned OCTRIG1R2:1;
      unsigned OCTRIG1R3:1;
      unsigned OCTRIG1R4:1;
      unsigned OCTRIG1R5:1;
      unsigned :2;
      unsigned INT1R0:1;
      unsigned INT1R1:1;
      unsigned INT1R2:1;
      unsigned INT1R3:1;
      unsigned INT1R4:1;
      unsigned INT1R5:1;
    };
  };
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile unsigned int  RPINR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR1BITS {
  union {
    struct {
      unsigned INT2R:6;
      unsigned :2;
      unsigned INT3R:6;
    };
    struct {
      unsigned INT2R0:1;
      unsigned INT2R1:1;
      unsigned INT2R2:1;
      unsigned INT2R3:1;
      unsigned INT2R4:1;
      unsigned INT2R5:1;
      unsigned :2;
      unsigned INT3R0:1;
      unsigned INT3R1:1;
      unsigned INT3R2:1;
      unsigned INT3R3:1;
      unsigned INT3R4:1;
      unsigned INT3R5:1;
    };
  };
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile unsigned int  RPINR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR2BITS {
  union {
    struct {
      unsigned INT4R:6;
      unsigned :2;
      unsigned OCTRIG2R:6;
    };
    struct {
      unsigned INT4R0:1;
      unsigned INT4R1:1;
      unsigned INT4R2:1;
      unsigned INT4R3:1;
      unsigned INT4R4:1;
      unsigned INT4R5:1;
      unsigned :2;
      unsigned OCTRIG2R0:1;
      unsigned OCTRIG2R1:1;
      unsigned OCTRIG2R2:1;
      unsigned OCTRIG2R3:1;
      unsigned OCTRIG2R4:1;
      unsigned OCTRIG2R5:1;
    };
  };
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

