Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB204.h
/* SPI1IMSK2 */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI1URDTL */
#define _SPI1URDTL SPI1URDTLbits.SPI1URDTL
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* SPI1URDTH */
#define _SPI1URDTH SPI1URDTHbits.SPI1URDTH
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* SPI2CON1 */
/* Bitname _ENHBUF cannot be defined because it is used by more than one SFR */
/* Bitname _SPIFE cannot be defined because it is used by more than one SFR */
/* Bitname _MCLKEN cannot be defined because it is used by more than one SFR */
/* Bitname _DISSCK cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDI cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE32 cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDO cannot be defined because it is used by more than one SFR */
/* Bitname _SPISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */

/* SPI2CON1L */
/* Bitname _ENHBUF cannot be defined because it is used by more than one SFR */
/* Bitname _SPIFE cannot be defined because it is used by more than one SFR */
/* Bitname _MCLKEN cannot be defined because it is used by more than one SFR */
/* Bitname _DISSCK cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDI cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE32 cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDO cannot be defined because it is used by more than one SFR */
/* Bitname _SPISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */

/* SPI2CON1H */
/* Bitname _FRMCNT cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYPW cannot be defined because it is used by more than one SFR */
/* Bitname _MSSEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _URDTEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMONO cannot be defined because it is used by more than one SFR */
/* Bitname _IGNTUR cannot be defined because it is used by more than one SFR */
/* Bitname _IGNROV cannot be defined because it is used by more than one SFR */
/* Bitname _SPISGNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _AUDEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD1 cannot be defined because it is used by more than one SFR */

/* SPI2CON2 */
/* Bitname _FRMCNT cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYPW cannot be defined because it is used by more than one SFR */
/* Bitname _MSSEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _URDTEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMONO cannot be defined because it is used by more than one SFR */
/* Bitname _IGNTUR cannot be defined because it is used by more than one SFR */
/* Bitname _IGNROV cannot be defined because it is used by more than one SFR */
/* Bitname _SPISGNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _AUDEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD1 cannot be defined because it is used by more than one SFR */

